Documents/ПередачаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаОС</Name>
			<BasedOn>
				<xr:Item>Catalog.ОсновныеСредства</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.НДСНеоблагаемыеОперации</xr:Item>
				<xr:Item>AccumulationRegister.ИПРБП</xr:Item>
				<xr:Item>InformationRegister.ДокументыПоНеоблагаемымНДСОперациям</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>AccumulationRegister.ПрослеживаемыеОсновныеСредства</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗ</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗОбороты</xr:Item>
				<xr:Item>InformationRegister.ОперацииСПрослеживаемымиТоварами</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовПатент</xr:Item>
				<xr:Item>InformationRegister.РасчетАмортизацииГрупповыхОбъектовОС</xr:Item>
				<xr:Item>AccumulationRegister.ИППрочиеРасходы</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.СостоянияОСОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>InformationRegister.РублевыеСуммыДокументовВВалюте</xr:Item>
				<xr:Item>InformationRegister.РасчетРасходовПоАренде</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ИППрочиеДоходы</xr:Item>
				<xr:Item>AccumulationRegister.СрокиИспользованияГрупповыхОбъектовОС</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.ИПДоходы</xr:Item>
				<xr:Item>InformationRegister.РасчетАмортизации</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗОтгруженные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокПодготовкаКПередачеОС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачетаАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВосстановитьАмортизационнуюПремию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДляВосстановленияАмортизационнойПремии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовПоАвансам</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоСобственностиПереходитПослеГосРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДСПоРеализации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАвансов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>26</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОнлайнЗаказыБП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СтатусыЗаказовОнлайнЗаказовВФоне", Истина);
	
КонецПроцедуры

// Выполняет загрузку статусов онлайн-заказов, по которым было
// отложено получение результата.
// Обертка для запуска в фоне функции ОнлайнЗаказы.СтатусыЗаказов()
Функция СтатусыЗаказовОнлайнЗаказовВФоне() Экспорт
	
	Возврат ОнлайнЗаказы.СтатусыЗаказов();
	
КонецФункции

// Определяются данные для формирования запроса на создание/обновление онлайн-заказа.
// Все поля переменной ЗаказНаОплату (за исключением свойства ДополнительнаяИнформация) обязательны для заполнения.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    будет создан новый заказ.
//  ЗаказНаОплату - Структура - содержит описание онлайн-заказа:
//    * ОбщиеПараметрыЗаказа - Структура - описывает общие параметры заказа:
//      ** ТипКонтрагента - Строка - содержит тип контрагента, по которому будут определяться возможные виды оплат.
//         Может принимать значения:
//         - "ФизическоеЛицо" - покупателю будут доступны виды оплат для физических лиц.
//         - "ЮридическоеЛицо" - покупателю будут доступны виды оплат для физических лиц.
//         - "ФизическоеЛицоДоступенВыбор" - покупатель сможет выбрать от кого типа контрагента выполнять оплату
//            (физическое или юридическое лицо). Физическое лицо по умолчанию.
//         - "ЮридическоеЛицоДоступенВыбор" - покупатель сможет выбрать от кого типа контрагента выполнять оплату,
//            (физическое или юридическое лицо). Юридическое лицо по умолчанию.
//      ** СрокЖизни - Дата - содержит значение срока жизни заказа,
//         по наступлению указанного времени заказ будет аннулирован.
//         В случае передачи значения меньше текущей даты возвращается ошибка "НеверныйФорматЗапроса".
///    * ВизуализацияЗаказа - Структура - содержит описание шапки заказа на платежной странице.
//       ** Представление - Строка - представление заказа на платежной странице.
//       ** ДополнительнаяИнформация - Строка - дополнительная информация о заказе платежной страницы.
//       ** ПоставщикПредставление - Строка - содержит данные поставщика отображаемые на странице заказа.
//       ** ПоставщикЗаголовок - Строка - представление поставщика (пример: Поставщик, Исполнитель, Продавец).
//       ** ПокупательПредставление - Строка - содержит данные покупателя отображаемые на странице заказа.
//       ** ПокупательЗаголовок - Строка - представление покупателя (пример: Покупатель, Клиент).
//    * Товары - ТаблицаЗначений - Содержит данные товарного наполнения заказа.
//      Состав колонок определяется в методе ОнлайнЗаказыПереопределяемый.ПриНастройкеТаблицыТоваров
//    * ПараметрыОплат - Структура - Содержит описание видов оплат с их параметрами:
//      ** ПоРеквизитам - Структура - Содержит описание реквизитов оплаты:
//        *** ДанныеQR - Строка - Содержит реквизиты оплаты в формате УФЭБС.
//        *** Представление - Строка - Представление реквизиты оплаты в текстовом виде.
//      ** СБП - Структура - Содержит описание параметров оплаты СБП по вариантам сценария,
//         Неопределено, если подсистема не внедрена:
//        *** c2b - Структура, Неопределено - Содержит описание параметров оплаты СБП сценарию c2b,
//            Неопределено, если подсистема не внедрена или сценарий не используется:
//          **** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//               в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//               делать строку не длинной и включать информацию об организации, которая
//               является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//               Если строка не заполнена, будет передано стандартное представление
//               назначения: Оплата СБП {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//               Длина строки не должна превышать 140 символов, в противном случае будет
//               обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//               к символам и их кодировке. Возможна передача следующих значений:
//                 - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//                 [065-090] и [097-122] в кодировке UTF-8;
//                 - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//                 [1040-1103] в кодировке UTF-8;
//                 - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                 - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                 [091-096], [123-126] в кодировке UTF-8;
//                 - символ "№" под номером 8470 в кодировке UTF-8.
//          **** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//            ***** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//            ***** Идентификатор - Строка - идентификатор шаблона.
//            ***** Наименование - Строка - наименование шаблона для пользователя.
//            ***** Параметры -Массив Из Структура - параметры заполнения шаблона:
//              ****** Наименование - Строка - наименование параметра для пользователя.
//              ****** Идентификатор - Строка - идентификатор параметра для заполнения.
//        *** b2b - Структура, Неопределено - Содержит описание параметров оплаты СБП сценарию b2b,
//            Неопределено, если подсистема не внедрена или сценарий не используется:
//          **** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//               в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//               делать строку не длинной и включать информацию об организации, которая
//               является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//               Если строка не заполнена, будет передано стандартное представление
//               назначения: Оплата СБП {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//               Длина строки не должна превышать 210 символов, в противном случае будет
//               обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//               к символам и их кодировке. Возможна передача следующих значений:
//                 - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//                 [065-090] и [097-122] в кодировке UTF-8;
//                 - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//                 [1040-1103] в кодировке UTF-8;
//                 - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                 - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                 [091-096], [123-126] в кодировке UTF-8;
//                 - символ "№" под номером 8470 в кодировке UTF-8.
//          **** ОблагаетсяНДС - Булево - информация о взимании НДС. Если Истина - облагается НДС,
//               если Ложь не облагается НДС;
//          **** СуммаНДС - Число - сумма НДС. Если поле ОблагаетсяНДС равно Ложь, поле не заполняется;
//          **** РасчетныйСчет - Строка - расчетный счет получателя платежа. Длина строки не должна превышать
//               20 символов, в противном случае будет обрезана принудительно;
//          **** ИдентификаторПлатежа - Строка - уникальный Идентификатор Платежа, назначаемый Получателем.
//               Длина строки не должна превышать 35 символов, в противном случае будет обрезана принудительно;
//          **** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//            ***** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//            ***** Идентификатор - Строка - идентификатор шаблона.
//            ***** Наименование - Строка - наименование шаблона для пользователя.
//            ***** Параметры -Массив Из Структура - параметры заполнения шаблона:
//              ****** Наименование - Строка - наименование параметра для пользователя.
//              ****** Идентификатор - Строка - идентификатор параметра для заполнения.
//       ** ИнтернетЭквайринг - Структура - Содержит описание параметров оплаты через Интернет-эквайринг,
//         Неопределено, если подсистема не внедрена:
//         *** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//               в момент оплаты. Рекомендуется делать строку не длинной и включать информацию об
//               организации, которая является получателем денежных средств, например: 
//               Оплата 524,00 RUB по Заказу №1 от 01.01.2025 ООО Ромашка.
//               Если строка не заполнена, будет передано стандартное представление
//               назначения: Оплата {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//               Длина строки не должна превышать 140 символов, в противном случае будет
//               обрезана принудительно. 
//               Дополнительные требования к символам и их кодировке. Возможна передача следующих значений:
//                 -- символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//                 [065-090] и [097-122] в кодировке UTF-8;
//                 -- символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//                 [1040-1103] в кодировке UTF-8;
//                 -- цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                 -- специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                 [091-096], [123-126] в кодировке UTF-8;
//                 -- символ "№" под номером 8470 в кодировке UTF-8.
//          *** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//            **** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//            **** Идентификатор - Строка - идентификатор шаблона.
//            **** Наименование - Строка - наименование шаблона для пользователя.
//            **** Параметры -Массив Из Структура - параметры заполнения шаблона:
//              ***** Наименование - Строка - наименование параметра для пользователя.
//              ***** Идентификатор - Строка - идентификатор параметра для заполнения.
//       ** ОзонПэй - Структура - Содержит описание параметров оплаты через Ozon Pay,
//         Неопределено, если подсистема не внедрена:
//         *** НазначениеПлатежа - Строка - в текущей версии не используется.
//         *** ШаблоныНазначения - ТаблицаЗначений - в текущей версии не используется.
//    * ПараметрыФискализации - Структура, Неопределено - Содержит параметры фискализации онлайн-заказа,
//         Неопределено, если подсистема не внедрена или не выбрана настройка подключения к облачной кассе:
//      ** ДанныеЧека - Структура - Содержит данные для фискализации онлайн-чека.
//           Для заполнения рекомендуется воспользоваться методами БПО:
//           - ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека()
//           для получения пустой структуры данных чека для заполнения
//           - ОборудованиеЧекопечатающиеОблачныеККТ.ДанныеВФорматеОблачныхККТ()
//           для преобразования заполненных данных чека в формат 1С:Облачная касса
Процедура ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату) Экспорт
	
	
	СведенияОДокументах = Документы.СчетНаОплатуПокупателю.ПолучитьТаблицуСведенийСчетаНаОплату(ОБщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументЗаказа));
	Для каждого ВыборкаШапка Из СведенияОДокументах Цикл
		
		СведенияОДокументе = ВыборкаШапка;
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СведенияОДокументе.Поставщик, СведенияОДокументе.ДатаДляПолученияСведений);
		СведенияОКонтрагенте  = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СведенияОДокументе.Покупатель, СведенияОДокументе.ДатаДляПолученияСведений);
		
		ЗаказНаОплату.ОбщиеПараметрыЗаказа.СрокЖизни 				= Мин(СведенияОДокументе.СрокОплаты, СведенияОДокументе.ДатаДокумента + 30 * 24 * 60 * 60);
		ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента			= ?(СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, "ЮридическоеЛицо", "ФизическоеЛицоДоступенВыбор");
		ЗаказНаОплату.ВизуализацияЗаказа.Представление 				= СтрШаблон(
			НСтр("ru = '%3 № %1 от %2.'"), 
			СведенияОДокументе.НомерДокумента, 
			Формат(СведенияОДокументе.ДатаДокумента, "ДЛФ=D"),
			СведенияОДокументе.ЗаголовокСчета);

		ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикПредставление 	= СокрЛП(СведенияОбОрганизации.ПолноеНаименование);
		ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикЗаголовок 		= НСтр("ru = 'Продавец'");
		ЗаказНаОплату.ВизуализацияЗаказа.ПокупательПредставление 	= СокрЛП(СведенияОКонтрагенте.ПолноеНаименование);
		ЗаказНаОплату.ВизуализацияЗаказа.ПокупательЗаголовок 		= НСтр("ru = 'Покупатель'");
		
		ТаблицаДокумента = СведенияОДокументе.ТаблицаДокумента;
		
		ДанныеПечатиИтоговНДС = Новый Структура("НДС, ВсегоНДС");
		
		Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
			СтрокаНоменклатуры = ЗаказНаОплату.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры, СтрокаДокумента);
			
			СтрокаНоменклатуры.Наименование 		= СтрокаДокумента.НоменклатураНаименование;
			СтрокаНоменклатуры.ИдентификаторТовара  = Строка(СтрокаДокумента.Номенклатура.УникальныйИдентификатор());
			СтрокаНоменклатуры.Скидка 				= СтрокаДокумента.СуммаСкидки;
			
			СтрокаНоменклатуры.СуммаСоСкидкой       = ?(СведенияОДокументе.СуммаВключаетНДС, СтрокаДокумента.Сумма, СтрокаДокумента.Сумма + СтрокаДокумента.СуммаНДС) - СтрокаДокумента.СуммаСкидки;
		КонецЦикла;
		
		НДСИсчисляетсяНалоговымАгентом = СведенияОДокументе.НДСИсчисляетсяНалоговымАгентом = Истина
			И УчетНДС.ВедетсяУчетНДСПоФЗ335(СведенияОДокументе.ДатаДляПолученияСведений);
		
		ДанныеПечатиИтоговНДС = Новый Структура("НДС, ВсегоНДС");
		Если НДСИсчисляетсяНалоговымАгентом Тогда
			ДанныеПечатиИтоговНДС.НДС      = УчетНДС.НадписьСтавкаНДСИсчисляетсяНалоговымАгентом();
			ДанныеПечатиИтоговНДС.ВсегоНДС = НСтр("ru = '-'");
		Иначе
			СтавкиНДС = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаДокумента, "СтавкаНДС", Истина);
			ЗаполнитьЗначенияСвойств(ДанныеПечатиИтоговНДС, 
				ПечатьТорговыхДокументов.ДанныеПечатиИтоговНДС(ТаблицаДокумента.Итог("СуммаНДС"), СтавкиНДС, СведенияОДокументе.СуммаВключаетНДС, ":"));
		КонецЕсли;
		
		ДанныеПечатиЗаголовокСчета = Новый Структура;
		ДанныеПечатиЗаголовокСчета.Вставить("ИННПолучателя", СведенияОбОрганизации.ИНН);
		ДанныеПечатиЗаголовокСчета.Вставить("КПППолучателя", СведенияОбОрганизации.КПП);
		
		Если ТипЗнч(СведенияОДокументе.БанковскийСчетПродавца) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			ДанныеПечатиЗаголовокСчета.Вставить("БИКБанкаПолучателя",СведенияОДокументе.БикБанкаПолучателя);
			ДанныеПечатиЗаголовокСчета.Вставить("БанкПолучателя",СведенияОДокументе.БанкПолучателя);
			ДанныеПечатиЗаголовокСчета.Вставить("БанкПолучателяПредставление",СокрЛП(СведенияОДокументе.НаименованиеБанкаПолучателя));
			ДанныеПечатиЗаголовокСчета.Вставить("СчетБанкаПолучателя",СведенияОДокументе.СчетБанкаПолучателя);
			ДанныеПечатиЗаголовокСчета.Вставить("СчетБанкаПолучателяПредставление",СведенияОДокументе.СчетБанкаПолучателя);
			Если СведенияОДокументе.ЦифровойСчет Тогда
				ДанныеПечатиЗаголовокСчета.Вставить("СчетПолучателяПредставление", СведенияОДокументе.ИдентификаторЦифровогоСчета);
				ДанныеПечатиЗаголовокСчета.Вставить("СчетПолучателя",              СведенияОДокументе.ИдентификаторЦифровогоСчета);
			Иначе
				ДанныеПечатиЗаголовокСчета.Вставить("СчетПолучателяПредставление", СведенияОДокументе.НомерСчетаПолучателя);
				ДанныеПечатиЗаголовокСчета.Вставить("СчетПолучателя", СведенияОДокументе.НомерСчетаПолучателя);
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеПолучателя = УчетДенежныхСредствБП.СформироватьТекстНаименованияПлательщикаПолучателя(, СведенияОДокументе.Получатель, СведенияОДокументе.БанковскийСчетПродавца, , СведенияОДокументе.ДатаДляПолученияСведений);
		ДанныеПечатиЗаголовокСчета.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
		
		РеквизитыПлатежа = ПечатьТорговыхДокументов.РеквизитыПлатежа(СведенияОДокументе, ДанныеПечатиЗаголовокСчета, ДанныеПечатиИтоговНДС); 
		
		ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.ДанныеQR = ПечатьТорговыхДокументов.QRСтрокаРеквизитыПлатежа(РеквизитыПлатежа);
		
		ПредставлениеПолучателяПлатежа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1, ИНН: %2, КПП: %3'"),
			РеквизитыПлатежа.ТекстПолучателя,
			РеквизитыПлатежа.ИННПолучателя,
			РеквизитыПлатежа.КПППолучателя);
	
		ПредставлениеСчетаПолучателя = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'р/с: %1 в: %2, корр.сч: %3, БИК: %4'"),
			РеквизитыПлатежа.НомерСчетаПолучателя,
			РеквизитыПлатежа.НаименованиеБанкаПолучателя,
			РеквизитыПлатежа.СчетБанкаПолучателя,
			РеквизитыПлатежа.БИКБанкаПолучателя);
		
		ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1, %2, %3'"),
			ПредставлениеПолучателяПлатежа,
			ПредставлениеСчетаПолучателя,
			РеквизитыПлатежа.НазначениеПлатежа);
			
		Если ЗаказНаОплату.ПараметрыФискализации <> Неопределено Тогда 
			ДанныеЧеков = ПечатьФискальныхДокументов.СобратьДанныеЧеков(СведенияОДокументе.Документ,,,,Новый Структура("ТипОбъекта, ИмяОбъекта", "ОбщийМодуль","ОнлайнЗаказыБП"));
			Для каждого ДанныеДляФискализации Из ДанныеЧеков Цикл
				КонтактнаяИнформацияДляПечатиЧека = ПечатьФискальныхДокументов.КонтактнаяИнформацияДляПечатиЧека(СведенияОДокументе.Покупатель);
				Если Не ЗначениеЗаполнено(ДанныеДляФискализации.ПокупательEmail) Тогда
					ДанныеДляФискализации.ПокупательEmail = КонтактнаяИнформацияДляПечатиЧека.ПокупательEmail;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ДанныеДляФискализации.ПокупательНомер) Тогда
					ДанныеДляФискализации.ПокупательНомер = КонтактнаяИнформацияДляПечатиЧека.ПокупательНомер;
				КонецЕсли;
				ДанныеДляФискализации.МестоРасчетов = ДанныеДляФискализации.АдресМагазина;
				ДанныеДляОблачнойКассы = ОборудованиеЧекопечатающиеОблачныеККТ.ДанныеВФорматеОблачныхККТ(ДанныеДляФискализации); 
				ЗаказНаОплату.ПараметрыФискализации.ДанныеЧека = ДанныеДляОблачнойКассы;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗаказНаОплату.ПараметрыОплат.СБП.b2b <> Неопределено Тогда
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.СуммаНДС = ТаблицаДокумента.Итог("СуммаНДС");
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ОблагаетсяНДС = (ТаблицаДокумента.Итог("СуммаНДС") <> 0);
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.РасчетныйСчет = СведенияОДокументе.НомерСчетаПолучателя;
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ИдентификаторПлатежа = СведенияОДокументе.ИдентификаторПлатежаСБП;
			
			ЗаполнитьНазначениеПлатежа(ЗаказНаОплату.ПараметрыОплат.СБП.b2b, ДокументЗаказа);
		ИначеЕсли ЗаказНаОплату.ПараметрыОплат.СБП.c2b <> Неопределено Тогда
			ЗаполнитьНазначениеПлатежа(ЗаказНаОплату.ПараметрыОплат.СБП.c2b, ДокументЗаказа);
		КонецЕсли;
		
		Если ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг <> Неопределено Тогда
			ЗаполнитьНазначениеПлатежа(ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг, ДокументЗаказа);
		КонецЕсли;
		
		Если ЗаказНаОплату.ПараметрыОплат.ОзонПэй <> Неопределено Тогда
			ЗаполнитьНазначениеПлатежа(ЗаказНаОплату.ПараметрыОплат.ОзонПэй, ДокументЗаказа);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗагрузкеСтатусаЗаказа(ДокументОперации,
									 СтатусЗаказа,
									 ПараметрыОплаты,
									 ПараметрыФискализации,
									 Обработан) Экспорт
									 

	Если ПараметрыОплаты["СБПc2b"] <> Неопределено Тогда
		НастройкаПодключения = ПараметрыОплаты["СБПc2b"].НастройкаПодключения;
		РезультатОбработки   = ПараметрыОплаты["СБПc2b"].РезультатОбработки;
	ИначеЕсли ПараметрыОплаты["СБПb2b"] <> Неопределено Тогда
		НастройкаПодключения = ПараметрыОплаты["СБПb2b"].НастройкаПодключения;
		РезультатОбработки   = ПараметрыОплаты["СБПb2b"].РезультатОбработки;
	ИначеЕсли ПараметрыОплаты["ИнтернетЭквайринг"] <> Неопределено Тогда
		НастройкаПодключения = ПараметрыОплаты["ИнтернетЭквайринг"].НастройкаПодключения;
		РезультатОбработки   = ПараметрыОплаты["ИнтернетЭквайринг"].РезультатОбработки;
	ИначеЕсли ПараметрыОплаты["ОзонПэй"] <> Неопределено Тогда
		НастройкаПодключения = ПараметрыОплаты["ОзонПэй"].НастройкаПодключения;
		РезультатОбработки   = ПараметрыОплаты["ОзонПэй"].РезультатОбработки;
	Иначе
		Возврат;
	КонецЕсли;
	
	Обработан = Истина;
	Если РезультатОбработки.СтатусОперации <> НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена() Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияСПлатежнымиСистемамиБП.СоздатьОперациюПоПлатежнойКарте(ДокументОперации, НастройкаПодключения, РезультатОбработки, ПараметрыФискализации);

КонецПроцедуры

Процедура ПриАктивацииЗаказа(ДокументЗаказа, ВложенияЗаказа, ПараметрыЗаказа) Экспорт
	
	РезультатShare = ИнтеграцияShare.РезультатФормированияURLСсылкиНаЭлектронныйДокумент(ДокументЗаказа, ВложенияЗаказа, Неопределено, Неопределено);
	
	НастройкиПубликации = Новый Структура;
	
	НастройкиПубликации.Вставить("ДлительностьСрокаЖизни", ПараметрыЗаказа.СрокЖизни);
	НастройкиПубликации.Вставить("ДоступноРучноеУправление", Ложь);
	НастройкиПубликации.Вставить("ИнициаторПубликации", "ОнлайнЗаказы");
	НастройкиПубликации.Вставить("СхемаПубликации", ИнтеграцияShareКлиентСервер.СхемыПубликацииДокумента().Стандартная);
	 
	ПараметрыЗаказа.СервисShare.URLДокумента = РезультатShare.URLСсылка;
	ПараметрыЗаказа.СервисShare.ОшибкаПолученияURL = НЕ ЗначениеЗаполнено(РезультатShare.URLСсылка);
	
КонецПроцедуры

Функция СчетОплачен(СчетНаОплату, СпособОплаты) Экспорт
	ДанныеЗаказа = ОнлайнЗаказы.ДанныеЗаказов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СчетНаОплату))[СчетНаОплату];
	Если ДанныеЗаказа = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазрешенныеСпособы = Новый массив;
	РазрешенныеСпособы.Добавить("Эквайринг");
	РазрешенныеСпособы.Добавить("ОзонПэй");
	
	СпособОплаты = ДанныеЗаказа.ПараметрыЗаказа.СпособОплаты;
	
	Возврат ДанныеЗаказа.СтатусЗаказа = "Выполнен" 
		И РазрешенныеСпособы.Найти(ДанныеЗаказа.ПараметрыЗаказа.СпособОплаты) <> Неопределено;

КонецФункции

Функция ДанныеВозвратОплаты(ДанныеДокумента) Экспорт
	
	Результат = НовыйДанныеВозвратОплаты();
	
	Если Не ДанныеДокумента.ЭтоВозвратОнлайнЗаказы Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Доступен = Истина;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.Ссылка) 
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеДокумента.СпособОплаты) Тогда
		
		// Это новый документ возврата, а значит сам возврат еще не выполнен. Поэтому команда возврата должна быть доступна.
		Возврат Результат;
	КонецЕсли;
	
	
	Если ДанныеДокумента.СпособОплаты = "Эквайринг" Тогда
		СтатусыОпераций = НастройкиПлатежныхСистем.СтатусыОпераций(ДанныеДокумента.Ссылка);
		Если СтатусыОпераций["ИнтернетЭквайринг"] = Неопределено Тогда
			
			// Возврат не выполнен
			Возврат Результат;
		КонецЕсли;
		
		ДанныеОперации = ИнтернетЭквайринг.СтатусВозврата(ДанныеДокумента.Ссылка);
		Результат.Доступен = Истина;
		
		Результат.Исполнен    = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена();
		Результат.Отклонен    = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтклонена();
		Результат.Отменена    = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
		Результат.Ошибка      = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка();
		Результат.Выполняется = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
		
		Результат.ТекстПредупреждения = ТекстПредупрежденияВозврата(Результат);
	Иначе
		ДанныеОперации = ПлатежныеСистемы.ДанныеОперации(ДанныеДокумента.Ссылка); 
		
		Если ЗначениеЗаполнено(ДанныеОперации) Тогда
			Результат.Доступен = Не ДанныеОперации.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииОплата();
			Если Результат.Доступен Тогда
				Результат.Исполнен    = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена();
				Результат.Отклонен    = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтклонена();
				Результат.Отменена    = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
				Результат.Ошибка      = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка();
				Результат.Выполняется = ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ДоступнаИнтеграция() Экспорт
	
	Результат = ПравоДоступа("Чтение", Метаданные.Справочники.НастройкиПодключенияКОнлайнЗаказам);
	
	Возврат Результат;
	
КонецФункции

#Область ПечатьЧека

Функция ТекстЗапросаПараметрыПечатиЧека(ДокументСсылка, ИменаТаблиц, СообщениеОбОшибке) Экспорт
	
	// Чек на предоплату по счету
	ТекстЗапроса = ТекстЗапросаРеквизитыПечатиЧека(ИменаТаблиц) 
		+ Документы.ПередачаОС.ТекстЗапросаРеализацииПоСчету(ИменаТаблиц)
		+ Документы.РеализацияТоваровУслуг.ТекстЗапросаРеализацииПоСчету(ИменаТаблиц)
		+ Документы.СчетНаОплатуПокупателю.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц)
		+ Документы.РеализацияТоваровУслуг.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц)
		+ Документы.ПередачаОС.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц);
	
	Возврат ТекстЗапроса;
КонецФункции

Функция НаименованиеВСтрокеЧека(Реквизиты) Экспорт
	НаименованиеВСтрокеЧека = "";
	
	СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Контрагент, Реквизиты.Дата);
	ПредставлениеПокупателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм");
	НаименованиеВСтрокеЧека = НСтр("ru = 'Оплата от:'") + " " + ПредставлениеПокупателя;
	
	Возврат НаименованиеВСтрокеЧека;
КонецФункции     

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНазначениеПлатежа(ПараметрыОплат, ДокументЗаказа)

	Отбор = Новый Структура;
	Отбор.Вставить("Идентификатор", ДокументЗаказа.Метаданные().Имя);
	НайденныеСтроки = ПараметрыОплат.ШаблоныНазначения.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ШаблонНазначения = НайденныеСтроки[0];
	Иначе
		ШаблонНазначения = Неопределено;
	КонецЕсли;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗаказа,
		"Организация, СуммаДокумента, Дата, Номер, ДокументБезНДС, СтруктурнаяЕдиница");
	
	НазначениеПлатежа = ИнтеграцияСПлатежнымиСистемамиБП.НазначениеПлатежа(ШаблонНазначения, ДанныеДокумента);
	Если ЗначениеЗаполнено(НазначениеПлатежа) Тогда
		ПараметрыОплат.НазначениеПлатежа = НазначениеПлатежа;
	КонецЕсли;
КонецПроцедуры

Функция ТекстЗапросаРеквизитыПечатиЧека(ИменаТаблиц)
	ИменаТаблиц.Добавить("ВТ_РеквизитыШапки");
	ИменаТаблиц.Добавить("ВТ_РеализацииПоСчету");
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежа");
	ИменаТаблиц.Добавить("РеквизитыПечатиЧека");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
	|	СчетНаОплатуПокупателю.Дата КАК Дата,
	|	СчетНаОплатуПокупателю.Номер КАК Номер,
	|	Ложь КАК ЭтоВозврат,
	|	СчетНаОплатуПокупателю.ВалютаДокумента КАК ВалютаДокумента,
	|	ЕСТЬNULL(ДоговорыПлатежногоАгента.Ссылка, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорПлатежногоАгента,
	|	ЕСТЬNULL(ДоговорыПлатежногоАгента.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПлатежныйАгент
	|ПОМЕСТИТЬ ВТ_РеквизитыШапки
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыПлатежногоАгента
	|		ПО СчетНаОплатуПокупателю.ДоговорКонтрагента = ДоговорыПлатежногоАгента.Ссылка И ДоговорыПлатежногоАгента.ПлатежныйАгент
	|ГДЕ
	|	СчетНаОплатуПокупателю.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров,
	|	&ДокументСсылка КАК СчетНаОплату
	|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументСсылка
	|	И ЕСТЬNULL(РеализацияТоваровУслуг.Проведен, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДокументСсылка КАК Ссылка,
	|	СчетНаОплатуПокупателюРасшифровкаПлатежа.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетНаОплатуПокупателюРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	СчетНаОплатуПокупателюРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|	&ДокументСсылка КАК Сделка,
	|	СчетНаОплатуПокупателюРасшифровкаПлатежа.Сумма - СчетНаОплатуПокупателюРасшифровкаПлатежа.СуммаСкидки КАК СуммаПлатежа,
	|	СчетНаОплатуПокупателюРасшифровкаПлатежа.Сумма - СчетНаОплатуПокупателюРасшифровкаПлатежа.СуммаСкидки КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюРасшифровкаПлатежа
	|ГДЕ
	|	СчетНаОплатуПокупателюРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеквизитыШапки.Ссылка КАК Ссылка,
	|	ВТ_РеквизитыШапки.Организация КАК Организация,
	|	ВТ_РеквизитыШапки.СуммаДокумента КАК СуммаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	ВТ_РеквизитыШапки.Контрагент КАК Контрагент,
	|	ИСТИНА КАК ВыводитьКонтрагентаВЧеке,
	|	ВТ_РеквизитыШапки.Дата КАК Дата,
	|	ВТ_РеквизитыШапки.Номер КАК Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно) КАК ТипОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ТипРасчета,
	|	ЛОЖЬ КАК Патент,
	|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ЛОЖЬ КАК НесколькоДоговоровПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ПлатежныйАгент КАК ПлатежныйАгент
	|ИЗ
	|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция НовыйДанныеВозвратОплаты()
	Результат = Новый Структура;
	
	Результат.Вставить("Исполнен",    Ложь);
	Результат.Вставить("Доступен",    Ложь);
	Результат.Вставить("Ошибка",      Ложь);
	Результат.Вставить("Отклонен",    Ложь);
	Результат.Вставить("Отменена",    Ложь);
	Результат.Вставить("Выполняется", Ложь);
	Результат.Вставить("ТекстПредупреждения", "");
	
	Возврат Результат;
КонецФункции

Функция ТекстПредупрежденияВозврата(СостояниеВозврата)
	ТекстПредупреждения = "";
	
	Если СостояниеВозврата.Отклонен Тогда
		ТекстПредупреждения = НСтр("ru = 'Возврат средств  отклонен.'");
	ИначеЕсли СостояниеВозврата.Ошибка Тогда
		ТекстПредупреждения = НСтр("ru = 'При возврате средств произошла ошибка. Подробности в Журнале регистрации.'");
	ИначеЕсли СостояниеВозврата.Отменена Тогда
		ТекстПредупреждения = НСтр("ru = 'Операция по возврату средств не выполнена (отменена банком), подробности в Журнале регистрации. Повторите операцию.'");
	ИначеЕсли СостояниеВозврата.Выполняется Тогда
		ТекстПредупреждения = НСтр("ru = 'Возврат средств не завершен. Повторите операцию.'");
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
КонецФункции

#КонецОбласти
